Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.this["gateway-conformance:main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
      ~ enforce_admins                  = true -> false
        id                              = "BPR_kwDOI6Wsp84CQl7F"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository.this["uci"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                          = "uci"
        name                        = "uci"
        # (33 unchanged attributes hidden)

      ~ security_and_analysis {

          ~ secret_scanning {
              ~ status = "disabled" -> "enabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "disabled" -> "enabled"
            }
        }
    }

  # github_repository_file.this["helia-mfs/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "helia-mfs"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["npm-kubo/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "npm-kubo"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["uci/.github/workflows/stale.yml"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/workflows/stale.yml [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: Close and mark stale issue
            
            on:
              schedule:
                - cron: '0 0 * * *'
            
            permissions:
              issues: write
              pull-requests: write
            
            jobs:
              stale:
                uses: pl-strflt/.github/.github/workflows/reusable-stale-issue.yml@v0.3
        EOT
      + file                = ".github/workflows/stale.yml"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "uci"
      + sha                 = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->